# 8 Week SQL Challenge
-----
### CASE STUDY 2 - Pizza Runner 
https://8weeksqlchallenge.com/case-study-2/ - refer to website for details regarding tables and data

### Contents:

* [Data Preprocessing](#Data-Preprocessing)

    * [Table: customer_orders](#Table:-customer_orders)
    * [Table: runner_orders](#Table:-runner_orders)
    * [Table: pizza_recipes](#Table:-pizza_recipes)
    * [Table: customer_orders [Part 2]](#Table:-customer_orders-[Part-2])
    
    

* [Part A - Pizza Metrics](#Part-A---Pizza-Metrics)




* [Part B - Runner and Customer Experience](#Part-B---Runner-and-Customer-Experience)




* [Part C - Ingredient Optimisation](#Part-C---Ingredient-Optimisation)




* [Part D - Pricing and Ratings](#Part-D---Pricing-and-Ratings)

In [1]:
%load_ext sql
%config SqlMagic.displaylimit = 0

In [2]:
#Connecting to postgresql database
%sql postgresql://postgres:yuanbin1229@localhost:5433/SQLchallenge

Connecting to 'postgresql://postgres:***@localhost:5433/SQLchallenge'

Creating tables and inserting data:

In [3]:
%%sql 

CREATE SCHEMA IF NOT EXISTS pizza_runner;
SET search_path = pizza_runner;

DROP TABLE IF EXISTS runners;
CREATE TABLE runners (
  "runner_id" INTEGER,
  "registration_date" DATE
);
INSERT INTO runners
  ("runner_id", "registration_date")
VALUES
  (1, '2021-01-01'),
  (2, '2021-01-03'),
  (3, '2021-01-08'),
  (4, '2021-01-15');


DROP TABLE IF EXISTS customer_orders;
CREATE TABLE customer_orders (
  "order_id" INTEGER,
  "customer_id" INTEGER,
  "pizza_id" INTEGER,
  "exclusions" VARCHAR(4),
  "extras" VARCHAR(4),
  "order_time" TIMESTAMP
);

INSERT INTO customer_orders
  ("order_id", "customer_id", "pizza_id", "exclusions", "extras", "order_time")
VALUES
  ('1', '101', '1', '', '', '2020-01-01 18:05:02'),
  ('2', '101', '1', '', '', '2020-01-01 19:00:52'),
  ('3', '102', '1', '', '', '2020-01-02 23:51:23'),
  ('3', '102', '2', '', NULL, '2020-01-02 23:51:23'),
  ('4', '103', '1', '4', '', '2020-01-04 13:23:46'),
  ('4', '103', '1', '4', '', '2020-01-04 13:23:46'),
  ('4', '103', '2', '4', '', '2020-01-04 13:23:46'),
  ('5', '104', '1', 'null', '1', '2020-01-08 21:00:29'),
  ('6', '101', '2', 'null', 'null', '2020-01-08 21:03:13'),
  ('7', '105', '2', 'null', '1', '2020-01-08 21:20:29'),
  ('8', '102', '1', 'null', 'null', '2020-01-09 23:54:33'),
  ('9', '103', '1', '4', '1, 5', '2020-01-10 11:22:59'),
  ('10', '104', '1', 'null', 'null', '2020-01-11 18:34:49'),
  ('10', '104', '1', '2, 6', '1, 4', '2020-01-11 18:34:49');


DROP TABLE IF EXISTS runner_orders;
CREATE TABLE runner_orders (
  "order_id" INTEGER,
  "runner_id" INTEGER,
  "pickup_time" VARCHAR(19),
  "distance" VARCHAR(7),
  "duration" VARCHAR(10),
  "cancellation" VARCHAR(23)
);

INSERT INTO runner_orders
  ("order_id", "runner_id", "pickup_time", "distance", "duration", "cancellation")
VALUES
  ('1', '1', '2020-01-01 18:15:34', '20km', '32 minutes', ''),
  ('2', '1', '2020-01-01 19:10:54', '20km', '27 minutes', ''),
  ('3', '1', '2020-01-03 00:12:37', '13.4km', '20 mins', NULL),
  ('4', '2', '2020-01-04 13:53:03', '23.4', '40', NULL),
  ('5', '3', '2020-01-08 21:10:57', '10', '15', NULL),
  ('6', '3', 'null', 'null', 'null', 'Restaurant Cancellation'),
  ('7', '2', '2020-01-08 21:30:45', '25km', '25mins', 'null'),
  ('8', '2', '2020-01-10 00:15:02', '23.4 km', '15 minute', 'null'),
  ('9', '2', 'null', 'null', 'null', 'Customer Cancellation'),
  ('10', '1', '2020-01-11 18:50:20', '10km', '10minutes', 'null');


DROP TABLE IF EXISTS pizza_names;
CREATE TABLE pizza_names (
  "pizza_id" INTEGER,
  "pizza_name" TEXT
);
INSERT INTO pizza_names
  ("pizza_id", "pizza_name")
VALUES
  (1, 'Meatlovers'),
  (2, 'Vegetarian');


DROP TABLE IF EXISTS pizza_recipes;
CREATE TABLE pizza_recipes (
  "pizza_id" INTEGER,
  "toppings" TEXT
);
INSERT INTO pizza_recipes
  ("pizza_id", "toppings")
VALUES
  (1, '1, 2, 3, 4, 5, 6, 8, 10'),
  (2, '4, 6, 7, 9, 11, 12');


DROP TABLE IF EXISTS pizza_toppings;
CREATE TABLE pizza_toppings (
  "topping_id" INTEGER,
  "topping_name" TEXT
);
INSERT INTO pizza_toppings
  ("topping_id", "topping_name")
VALUES
  (1, 'Bacon'),
  (2, 'BBQ Sauce'),
  (3, 'Beef'),
  (4, 'Cheese'),
  (5, 'Chicken'),
  (6, 'Mushrooms'),
  (7, 'Onions'),
  (8, 'Pepperoni'),
  (9, 'Peppers'),
  (10, 'Salami'),
  (11, 'Tomatoes'),
  (12, 'Tomato Sauce');

Running query in 'postgresql://postgres:***@localhost:5433/SQLchallenge'

4 rows affected.

14 rows affected.

10 rows affected.

2 rows affected.

2 rows affected.

12 rows affected.

++
||
++
++

## Data Preprocessing 
-------

### Table: customer_orders

In [4]:
%sql SELECT * FROM customer_orders;

Running query in 'postgresql://postgres:***@localhost:5433/SQLchallenge'

14 rows affected.

+----------+-------------+----------+------------+--------+---------------------+
| order_id | customer_id | pizza_id | exclusions | extras |      order_time     |
+----------+-------------+----------+------------+--------+---------------------+
|    1     |     101     |    1     |            |        | 2020-01-01 18:05:02 |
|    2     |     101     |    1     |            |        | 2020-01-01 19:00:52 |
|    3     |     102     |    1     |            |        | 2020-01-02 23:51:23 |
|    3     |     102     |    2     |            |  None  | 2020-01-02 23:51:23 |
|    4     |     103     |    1     |     4      |        | 2020-01-04 13:23:46 |
|    4     |     103     |    1     |     4      |        | 2020-01-04 13:23:46 |
|    4     |     103     |    2     |     4      |        | 2020-01-04 13:23:46 |
|    5     |     104     |    1     |    null    |   1    | 2020-01-08 21:00:29 |
|    6     |     101     |    2     |    null    |  null  | 2020-01-08 21:03:13 |
|    7     |     105     |    2     |    null    |   1    | 2020-01-08 21:20:29 |
|    8     |     102     |    1     |    null    |  null  | 2020-01-09 23:54:33 |
|    9     |     103     |    1     |     4      |  1, 5  | 2020-01-10 11:22:59 |
|    10    |     104     |    1     |    null    |  null  | 2020-01-11 18:34:49 |
|    10    |     104     |    1     |    2, 6    |  1, 4  | 2020-01-11 18:34:49 |
+----------+-------------+----------+------------+--------+---------------------+

From the table, it can be seen that columns "exclusions" and "extras" have its missing values represented in different ways:
- blank spaces - ''
- null values (None)
- null as string - 'null'

These columns will be cleaned by creating a new temporary table  with all the columns and the 'null'/missing values replaced with NULL.

In [5]:
%%sql
CREATE TEMP TABLE IF NOT EXISTS customer_orders_temp AS 
SELECT 
    order_id,
    customer_id,
    pizza_id,
    CASE 
        WHEN exclusions = '' OR exclusions = 'null' THEN NULL
        ELSE exclusions
    END AS exclusions,
    CASE 
        WHEN extras = '' OR extras = 'null' THEN NULL
        ELSE extras
    END AS extras,
    order_time
FROM customer_orders;

Running query in 'postgresql://postgres:***@localhost:5433/SQLchallenge'

14 rows affected.

++
||
++
++

Cleaned customer_orders_temp table will be used to run our queries.

In [6]:
%sql SELECT * FROM customer_orders_temp;

Running query in 'postgresql://postgres:***@localhost:5433/SQLchallenge'

14 rows affected.

+----------+-------------+----------+------------+--------+---------------------+
| order_id | customer_id | pizza_id | exclusions | extras |      order_time     |
+----------+-------------+----------+------------+--------+---------------------+
|    1     |     101     |    1     |    None    |  None  | 2020-01-01 18:05:02 |
|    2     |     101     |    1     |    None    |  None  | 2020-01-01 19:00:52 |
|    3     |     102     |    1     |    None    |  None  | 2020-01-02 23:51:23 |
|    3     |     102     |    2     |    None    |  None  | 2020-01-02 23:51:23 |
|    4     |     103     |    1     |     4      |  None  | 2020-01-04 13:23:46 |
|    4     |     103     |    1     |     4      |  None  | 2020-01-04 13:23:46 |
|    4     |     103     |    2     |     4      |  None  | 2020-01-04 13:23:46 |
|    5     |     104     |    1     |    None    |   1    | 2020-01-08 21:00:29 |
|    6     |     101     |    2     |    None    |  None  | 2020-01-08 21:03:13 |
|    7     |     105     |    2     |    None    |   1    | 2020-01-08 21:20:29 |
|    8     |     102     |    1     |    None    |  None  | 2020-01-09 23:54:33 |
|    9     |     103     |    1     |     4      |  1, 5  | 2020-01-10 11:22:59 |
|    10    |     104     |    1     |    None    |  None  | 2020-01-11 18:34:49 |
|    10    |     104     |    1     |    2, 6    |  1, 4  | 2020-01-11 18:34:49 |
+----------+-------------+----------+------------+--------+---------------------+

[Back to top](#Contents:)

### Table: runner_orders

In [7]:
%sql SELECT * FROM runner_orders;

Running query in 'postgresql://postgres:***@localhost:5433/SQLchallenge'

10 rows affected.

+----------+-----------+---------------------+----------+------------+-------------------------+
| order_id | runner_id |     pickup_time     | distance |  duration  |       cancellation      |
+----------+-----------+---------------------+----------+------------+-------------------------+
|    1     |     1     | 2020-01-01 18:15:34 |   20km   | 32 minutes |                         |
|    2     |     1     | 2020-01-01 19:10:54 |   20km   | 27 minutes |                         |
|    3     |     1     | 2020-01-03 00:12:37 |  13.4km  |  20 mins   |           None          |
|    4     |     2     | 2020-01-04 13:53:03 |   23.4   |     40     |           None          |
|    5     |     3     | 2020-01-08 21:10:57 |    10    |     15     |           None          |
|    6     |     3     |         null        |   null   |    null    | Restaurant Cancellation |
|    7     |     2     | 2020-01-08 21:30:45 |   25km   |   25mins   |           null          |
|    8     |     2     | 2020-01-10 00:15:02 | 23.4 km  | 15 minute  |           null          |
|    9     |     2     |         null        |   null   |    null    |  Customer Cancellation  |
|    10    |     1     | 2020-01-11 18:50:20 |   10km   | 10minutes  |           null          |
+----------+-----------+---------------------+----------+------------+-------------------------+

From inspecting the runner_orders table, it can be seen that multiple columns requires cleaning.
- In the "pickup_time" column, nulls need to be replaced with NULL.
- In the "distance" column, 'km' needs to be removed and nulls relaced with 0.
- In the "duration" column, 'minutes', 'minute' and 'mins' needs to be removed and nulls replaced with 0.
- In the "cancellation" column, blanks and null needs to be replaced with NULL.

In [8]:
%%sql
CREATE TEMP TABLE IF NOT EXISTS runner_orders_temp AS 
SELECT 
    order_id,
    runner_id,
    CASE 
        WHEN pickup_time = 'null' THEN NULL ELSE pickup_time 
    END AS pickup_time,
    CASE 
        WHEN distance LIKE '%km' THEN TRIM('km' FROM distance)
        WHEN distance = 'null' THEN '0'
        ELSE distance
    END AS distance,
    CASE 
        WHEN duration LIKE '%mins' THEN TRIM('mins' FROM duration)
        WHEN duration LIKE '%minute' THEN TRIM('minute' FROM duration)
        WHEN duration LIKE '%minutes' THEN TRIM('minutes' FROM duration)
        WHEN duration = 'null' THEN '0'
        ELSE duration
    END AS duration,
    CASE 
        WHEN cancellation = '' OR cancellation = 'null' THEN NULL
        ELSE cancellation
    END AS cancellation
FROM runner_orders;

Running query in 'postgresql://postgres:***@localhost:5433/SQLchallenge'

10 rows affected.

++
||
++
++

The datatype of "pickup_time", "distance" and "duration" columns now needs to be altered.

In [9]:
%%sql
ALTER TABLE runner_orders_temp
ALTER COLUMN pickup_time TYPE TIMESTAMP
    USING pickup_time::TIMESTAMP,
ALTER COLUMN distance TYPE NUMERIC
    USING distance::NUMERIC,
ALTER COLUMN duration TYPE INT
    USING duration::INTEGER;

Running query in 'postgresql://postgres:***@localhost:5433/SQLchallenge'

++
||
++
++

Cleaned runner_orders_temp table will be used to run our queries.

In [10]:
%sql SELECT * FROM runner_orders_temp;

Running query in 'postgresql://postgres:***@localhost:5433/SQLchallenge'

10 rows affected.

+----------+-----------+---------------------+----------+----------+-------------------------+
| order_id | runner_id |     pickup_time     | distance | duration |       cancellation      |
+----------+-----------+---------------------+----------+----------+-------------------------+
|    1     |     1     | 2020-01-01 18:15:34 |    20    |    32    |           None          |
|    2     |     1     | 2020-01-01 19:10:54 |    20    |    27    |           None          |
|    3     |     1     | 2020-01-03 00:12:37 |   13.4   |    20    |           None          |
|    4     |     2     | 2020-01-04 13:53:03 |   23.4   |    40    |           None          |
|    5     |     3     | 2020-01-08 21:10:57 |    10    |    15    |           None          |
|    6     |     3     |         None        |    0     |    0     | Restaurant Cancellation |
|    7     |     2     | 2020-01-08 21:30:45 |    25    |    25    |           None          |
|    8     |     2     | 2020-01-10 00:15:02 |   23.4   |    15    |           None          |
|    9     |     2     |         None        |    0     |    0     |  Customer Cancellation  |
|    10    |     1     | 2020-01-11 18:50:20 |    10    |    10    |           None          |
+----------+-----------+---------------------+----------+----------+-------------------------+

[Back to top](#Contents:)

### Table: pizza_recipes

In [11]:
%sql SELECT * FROM pizza_recipes

Running query in 'postgresql://postgres:***@localhost:5433/SQLchallenge'

2 rows affected.

+----------+-------------------------+
| pizza_id |         toppings        |
+----------+-------------------------+
|    1     | 1, 2, 3, 4, 5, 6, 8, 10 |
|    2     |    4, 6, 7, 9, 11, 12   |
+----------+-------------------------+

In the pizza_recipes table, the toppings id on each pizza are listed as a string separated by commas in a single cell, making querying difficult. 

Hence, a temporary table will be created which will have all the toppings on separate rows to make querying for 
future questions easier.

In [12]:
%%sql
DROP TABLE IF EXISTS pizza_recipes_temp;
CREATE TEMP TABLE pizza_recipes_temp AS 
SELECT
    pizza_id,
    unnest(string_to_array(toppings, ',')) AS toppings
FROM pizza_recipes;

Running query in 'postgresql://postgres:***@localhost:5433/SQLchallenge'

14 rows affected.

++
||
++
++

The following temporary table "pizza_recipes_temp" will be used in future queries.

In [13]:
%sql SELECT * FROM pizza_recipes_temp;

Running query in 'postgresql://postgres:***@localhost:5433/SQLchallenge'

14 rows affected.

+----------+----------+
| pizza_id | toppings |
+----------+----------+
|    1     |    1     |
|    1     |     2    |
|    1     |     3    |
|    1     |     4    |
|    1     |     5    |
|    1     |     6    |
|    1     |     8    |
|    1     |    10    |
|    2     |    4     |
|    2     |     6    |
|    2     |     7    |
|    2     |     9    |
|    2     |    11    |
|    2     |    12    |
+----------+----------+

[Back to top](#Contents:)

### Table: customer_orders [Part 2]

In [14]:
%sql SELECT * FROM customer_orders_temp;

Running query in 'postgresql://postgres:***@localhost:5433/SQLchallenge'

14 rows affected.

+----------+-------------+----------+------------+--------+---------------------+
| order_id | customer_id | pizza_id | exclusions | extras |      order_time     |
+----------+-------------+----------+------------+--------+---------------------+
|    1     |     101     |    1     |    None    |  None  | 2020-01-01 18:05:02 |
|    2     |     101     |    1     |    None    |  None  | 2020-01-01 19:00:52 |
|    3     |     102     |    1     |    None    |  None  | 2020-01-02 23:51:23 |
|    3     |     102     |    2     |    None    |  None  | 2020-01-02 23:51:23 |
|    4     |     103     |    1     |     4      |  None  | 2020-01-04 13:23:46 |
|    4     |     103     |    1     |     4      |  None  | 2020-01-04 13:23:46 |
|    4     |     103     |    2     |     4      |  None  | 2020-01-04 13:23:46 |
|    5     |     104     |    1     |    None    |   1    | 2020-01-08 21:00:29 |
|    6     |     101     |    2     |    None    |  None  | 2020-01-08 21:03:13 |
|    7     |     105     |    2     |    None    |   1    | 2020-01-08 21:20:29 |
|    8     |     102     |    1     |    None    |  None  | 2020-01-09 23:54:33 |
|    9     |     103     |    1     |     4      |  1, 5  | 2020-01-10 11:22:59 |
|    10    |     104     |    1     |    None    |  None  | 2020-01-11 18:34:49 |
|    10    |     104     |    1     |    2, 6    |  1, 4  | 2020-01-11 18:34:49 |
+----------+-------------+----------+------------+--------+---------------------+

Upon closer inspection of the table customer_orders_temp, like table pizza_recipes, columns "exclusions" and "extras" contain rows where multiple pizza topping ids are listed as a string and needs to be separated into different rows.

As those columns were unnecessary for [Part A - Pizza Metrics](#Part-A---Pizza-Metrics) and [Part B - Runner and Customer Experience](#Part-B---Runner-and-Customer-Experience), table customer_orders_temp was used. However, these columns are used in 
[Part C - Ingredient Optimisation](#Part-C---Ingredient-Optimisation), making the creation of another temporary table viable for those questions.

## Part A - Pizza Metrics
-------

##### 1. How many pizzas were ordered?
------

In [15]:
%%sql
SELECT 
    COUNT(order_id) AS order_count
FROM customer_orders_temp;

Running query in 'postgresql://postgres:***@localhost:5433/SQLchallenge'

1 rows affected.

+-------------+
| order_count |
+-------------+
|      14     |
+-------------+

##### 2. How many unique customer orders were made?
-------

In [16]:
%%sql
SELECT 
    COUNT(DISTINCT order_id) AS unique_orders_count
FROM customer_orders_temp;

Running query in 'postgresql://postgres:***@localhost:5433/SQLchallenge'

1 rows affected.

+---------------------+
| unique_orders_count |
+---------------------+
|          10         |
+---------------------+

##### 3. How many successful orders were delivered by each runner?
------

In [17]:
%%sql
SELECT 
    runner_id,
    COUNT(order_id) AS successful_orders
FROM runner_orders_temp
WHERE cancellation IS NULL
GROUP BY runner_id;

Running query in 'postgresql://postgres:***@localhost:5433/SQLchallenge'

3 rows affected.

+-----------+-------------------+
| runner_id | successful_orders |
+-----------+-------------------+
|     1     |         4         |
|     2     |         3         |
|     3     |         1         |
+-----------+-------------------+

##### 4. How many of each type of pizza was delivered?
------

In [18]:
%%sql 
SELECT 
    pn.pizza_name,
    COUNT(ro.order_id) AS delivered_count
FROM runner_orders_temp ro 
JOIN customer_orders_temp co 
    ON ro.order_id = co.order_id
JOIN pizza_names pn 
    ON co.pizza_id = pn.pizza_id
WHERE ro.cancellation IS NULL
GROUP BY pn.pizza_name
ORDER BY delivered_count DESC;

Running query in 'postgresql://postgres:***@localhost:5433/SQLchallenge'

2 rows affected.

+------------+-----------------+
| pizza_name | delivered_count |
+------------+-----------------+
| Meatlovers |        9        |
| Vegetarian |        3        |
+------------+-----------------+

##### 5. How many Vegetarian and Meatlovers were ordered by each customer?
------

In [19]:
%%sql
SELECT 
    co.customer_id,
    SUM (
        CASE WHEN pizza_name = 'Vegetarian' THEN 1 ELSE 0 END
    ) AS vegetarian,
    SUM (
        CASE WHEN pizza_name = 'Meatlovers' THEN 1 ELSE 0 END
    ) AS meatlovers
FROM customer_orders_temp co 
JOIN pizza_names pn 
    ON co.pizza_id = pn.pizza_id
GROUP BY co.customer_id
ORDER BY customer_id;

Running query in 'postgresql://postgres:***@localhost:5433/SQLchallenge'

5 rows affected.

+-------------+------------+------------+
| customer_id | vegetarian | meatlovers |
+-------------+------------+------------+
|     101     |     1      |     2      |
|     102     |     1      |     2      |
|     103     |     1      |     3      |
|     104     |     0      |     3      |
|     105     |     1      |     0      |
+-------------+------------+------------+

##### 6. What was the maximum number of pizzas delivered in a single order?
------

In [20]:
%%sql 
SELECT COUNT(co.order_id) AS max_pizza_order
FROM customer_orders_temp co 
JOIN runner_orders_temp ro 
    ON co.order_id = ro.order_id
WHERE ro.cancellation IS NULL
GROUP BY co.order_id
ORDER BY max_pizza_order DESC
LIMIT 1;

Running query in 'postgresql://postgres:***@localhost:5433/SQLchallenge'

1 rows affected.

+-----------------+
| max_pizza_order |
+-----------------+
|        3        |
+-----------------+

#####  7. For each customer, how many delivered pizzas had at least 1 change and how many had no changes?
------

In [21]:
%%sql
SELECT 
    co.customer_id,
    SUM (
        CASE 
            WHEN COALESCE(co.exclusions, co.extras) IS NULL 
            THEN 1 ELSE 0 
        END
    ) AS no_change,
    SUM (
        CASE 
            WHEN COALESCE(co.exclusions,co.extras) IS NOT NULL
            THEN 1 ELSE 0
        END
    ) AS changes
FROM customer_orders_temp co 
JOIN runner_orders_temp ro 
    ON co.order_id = ro.order_id
WHERE ro.cancellation IS NULL 
GROUP BY co.customer_id;

Running query in 'postgresql://postgres:***@localhost:5433/SQLchallenge'

5 rows affected.

+-------------+-----------+---------+
| customer_id | no_change | changes |
+-------------+-----------+---------+
|     101     |     2     |    0    |
|     102     |     3     |    0    |
|     103     |     0     |    3    |
|     104     |     1     |    2    |
|     105     |     0     |    1    |
+-------------+-----------+---------+

#####  8. How many pizzas were delivered that had both exclusions and extras?
-----

In [22]:
%%sql
SELECT 
    COUNT(co.order_id) AS both_extras_exclusions_count
FROM customer_orders_temp co
JOIN runner_orders_temp ro 
    ON co.order_id = ro.order_id
WHERE ro.cancellation IS NULL
    AND co.exclusions IS NOT NULL
    AND co.extras IS NOT NULL;

Running query in 'postgresql://postgres:***@localhost:5433/SQLchallenge'

1 rows affected.

+------------------------------+
| both_extras_exclusions_count |
+------------------------------+
|              1               |
+------------------------------+

#####  9. What was the total volume of pizzas ordered for each hour of the day?
-----

In [23]:
%%sql
SELECT 
    EXTRACT(HOUR FROM order_time) AS hour_of_the_day,
    COUNT(order_id) AS order_count
FROM customer_orders_temp
GROUP BY EXTRACT(HOUR FROM order_time)
ORDER BY hour_of_the_day;

Running query in 'postgresql://postgres:***@localhost:5433/SQLchallenge'

6 rows affected.

+-----------------+-------------+
| hour_of_the_day | order_count |
+-----------------+-------------+
|        11       |      1      |
|        13       |      3      |
|        18       |      3      |
|        19       |      1      |
|        21       |      3      |
|        23       |      3      |
+-----------------+-------------+

#####  10. What was the volume of orders for each day of the week?
-----

In [24]:
%%sql
SELECT 
    TO_CHAR(order_time + INTERVAL '2 day', 'Day') AS day_of_week,
    COUNT(order_id) AS order_count
FROM customer_orders_temp
GROUP BY TO_CHAR(order_time + INTERVAL '2 day', 'Day');

Running query in 'postgresql://postgres:***@localhost:5433/SQLchallenge'

4 rows affected.

+-------------+-------------+
| day_of_week | order_count |
+-------------+-------------+
|  Saturday   |      3      |
|  Sunday     |      1      |
|  Monday     |      5      |
|  Friday     |      5      |
+-------------+-------------+

[Back to top](#Contents:)

## Part B - Runner and Customer Experience
------

#####  1. How many runners signed up for each 1 week period? (i.e. week starts 2021-01-01)
----

In [25]:
%%sql 
SELECT 
    TO_CHAR(registration_date, 'w')::int AS week_num,
    COUNT(runner_id) AS runner_count
FROM runners
GROUP BY week_num
ORDER BY week_num;

Running query in 'postgresql://postgres:***@localhost:5433/SQLchallenge'

3 rows affected.

+----------+--------------+
| week_num | runner_count |
+----------+--------------+
|    1     |      2       |
|    2     |      1       |
|    3     |      1       |
+----------+--------------+

#####  2. What was the average time in minutes it took for each runner to arrive at the Pizza Runner HQ to pickup the order?
-----

In [26]:
%%sql
SELECT 
    ro.runner_id,
    ROUND (
        AVG (
            DATE_PART('hour', ro.pickup_time - co.order_time) +
            DATE_PART('minute', ro.pickup_time - co.order_time)
        )::DECIMAL
    , 2) AS pickup_time_mins
FROM customer_orders_temp co
JOIN runner_orders_temp ro 
    ON co.order_id = ro.order_id
WHERE ro.cancellation IS NULL
GROUP BY ro.runner_id;

Running query in 'postgresql://postgres:***@localhost:5433/SQLchallenge'

3 rows affected.

+-----------+------------------+
| runner_id | pickup_time_mins |
+-----------+------------------+
|     1     |      15.33       |
|     2     |      23.40       |
|     3     |      10.00       |
+-----------+------------------+

#####  3. Is there any relationship between the number of pizzas and how long the order takes to prepare?
-----

In [27]:
%%sql 
WITH prep_time_cte AS (
    SELECT 
        COUNT(co.order_id) AS pizzas_ordered,
        AVG(
            DATE_PART('hour', ro.pickup_time - co.order_time) +
            DATE_PART('minute', ro.pickup_time - co.order_time)
        ) AS avg_prep_time_mins
    FROM customer_orders_temp co 
    JOIN runner_orders_temp ro 
        ON co.order_id = ro.order_id
    WHERE ro.cancellation IS NULL
    GROUP BY co.order_id
)

SELECT 
    pizzas_ordered,
    AVG(avg_prep_time_mins) AS avg_prep_time_mins
FROM prep_time_cte
GROUP BY pizzas_ordered;

Running query in 'postgresql://postgres:***@localhost:5433/SQLchallenge'

3 rows affected.

+----------------+--------------------+
| pizzas_ordered | avg_prep_time_mins |
+----------------+--------------------+
|       1        |        12.0        |
|       2        |        18.0        |
|       3        |        29.0        |
+----------------+--------------------+

- There is a positive correlation between the number of pizzas ordered and preparation time, which makes logical sense. 
- The average time to make one pizza is lowest when two pizzas are ordered and highest when only one pizza is ordered, with the average time of making one pizza being 9 minutes and 12 minutes respectively.

#####  4. What was the average distance travelled for each customer?
-----

In [28]:
%%sql
SELECT 
    co.customer_id,
    ROUND(AVG(ro.distance), 2) as avg_dist_travelled
FROM customer_orders_temp co
JOIN runner_orders_temp ro 
    ON co.order_id = ro.order_id
WHERE ro.cancellation IS NULL
GROUP BY co.customer_id;

Running query in 'postgresql://postgres:***@localhost:5433/SQLchallenge'

5 rows affected.

+-------------+--------------------+
| customer_id | avg_dist_travelled |
+-------------+--------------------+
|     101     |       20.00        |
|     102     |       16.73        |
|     103     |       23.40        |
|     104     |       10.00        |
|     105     |       25.00        |
+-------------+--------------------+

#####  5. What was the difference between the longest and shortest delivery times for all orders?
-----

In [29]:
%%sql 
SELECT 
    MAX(duration) - MIN(duration) AS delivery_time_diff_mins
FROM runner_orders_temp
WHERE cancellation IS NULL;

Running query in 'postgresql://postgres:***@localhost:5433/SQLchallenge'

1 rows affected.

+-------------------------+
| delivery_time_diff_mins |
+-------------------------+
|            30           |
+-------------------------+

#####  6. What was the average speed for each runner for each delivery and do you notice any trend for these values?
-----

In [30]:
%%sql
SELECT 
    runner_id, 
    distance AS distance_km,
    ROUND(duration::DECIMAL / 60, 2) AS duration_hr,
    ROUND (
        distance / (duration::DECIMAL/60)  
    , 2) AS avg_delivery_speed_kmph
FROM runner_orders_temp
WHERE cancellation IS NULL
ORDER BY runner_id;

Running query in 'postgresql://postgres:***@localhost:5433/SQLchallenge'

8 rows affected.

+-----------+-------------+-------------+-------------------------+
| runner_id | distance_km | duration_hr | avg_delivery_speed_kmph |
+-----------+-------------+-------------+-------------------------+
|     1     |      20     |     0.53    |          37.50          |
|     1     |      20     |     0.45    |          44.44          |
|     1     |     13.4    |     0.33    |          40.20          |
|     1     |      10     |     0.17    |          60.00          |
|     2     |      25     |     0.42    |          60.00          |
|     2     |     23.4    |     0.25    |          93.60          |
|     2     |     23.4    |     0.67    |          35.10          |
|     3     |      10     |     0.25    |          40.00          |
+-----------+-------------+-------------+-------------------------+

#####  7. What is the successful delivery percentage for each runner?
-----

In [31]:
%%sql
SELECT 
    r.runner_id,
    ROUND (
        COUNT(order_id) * 100.0 / 
        (SELECT COUNT(r1.order_id)
         FROM runner_orders_temp r1
         WHERE r1.runner_id = r.runner_id) 
    , 2)AS success_delivery_perc
FROM runner_orders_temp r
WHERE r.cancellation IS NULL
GROUP BY r.runner_id

Running query in 'postgresql://postgres:***@localhost:5433/SQLchallenge'

3 rows affected.

+-----------+-----------------------+
| runner_id | success_delivery_perc |
+-----------+-----------------------+
|     1     |         100.00        |
|     2     |         75.00         |
|     3     |         50.00         |
+-----------+-----------------------+

[Back to top](#Contents:)

## Part C - Ingredient Optimisation
------

#####  1. What are the standard ingredients for each pizza?
-----

#####  2. What was the most commonly added extra?
-----

#####  3. What was the most common exclusion?
-----

#####  4. Generate an order item for each record in the customers_orders table in the format of one of the following:

- Meat Lovers
- Meat Lovers - Exclude Beef
- Meat Lovers - Extra Bacon
- Meat Lovers - Exclude Cheese, Bacon - Extra Mushroom, Peppers
-----

#####  5. Generate an alphabetically ordered comma separated ingredient list for each pizza order from the customer_orders table and add a 2x in front of any relevant ingredients
-----

#####  6. What is the total quantity of each ingredient used in all delivered pizzas sorted by most frequent first?
-----

[Back to top](#Contents:)

## Part D - Pricing and Ratings
------

#####  1. If a Meat Lovers pizza costs \\$12 and Vegetarian costs \\$10 and there were no charges for changes - how much money has Pizza Runner made so far if there are no delivery fees?
-----

#####  2. What if there was an additional \\$1 charge for any pizza extras?

- Add cheese is \\$1 extra

-----

#####  3. The Pizza Runner team now wants to add an additional ratings system that allows customers to rate their runner, how would you design an additional table for this new dataset - generate a schema for this new table and insert your own data for ratings for each successful customer order between 1 to 5.
------

#####  4. Using your newly generated table - can you join all of the information together to form a table which has the following information for successful deliveries?

- customer_id
- order_id
- runner_id
- rating
- order_time
- pickup_time
- Time between order and pickup
- Delivery duration
- Average speed
- Total number of pizzas
-----

#####  5. If a Meat Lovers pizza was \\$12 and Vegetarian \\$10 fixed prices with no cost for extras and each runner is paid \\$0.30 per kilometre traveled - how much money does Pizza Runner have left over after these deliveries?
-----

[Back to top](#Contents:)